{
  "audiovisual_files": {
    "bfc2ae3d-fa3e-49f4-9ff9-7c49f6c3d77c": {
      "label": "Miss Honey by Moi Renée",
      "is_offline": false,
      "file_url": "https://www.youtube.com/watch?v=E3S8OLCZuRc",
      "duration": 226
    }
  },
  "auto_generate_web_page": true,
  "description": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Moi Renée was a Jamaican-American drag queen from New York City, and her name ironically falls right in line with the concept of Renaissance. Meaning “me reborn”, Moi Renée is a figure that is not only relied on sonically by “PURE/HONEY” but through her personification of eccentric transformation and rebirth. Renée performed her 1992 hit, “Miss Honey”, on the The Sybil Bruncheon show in 1994– one of the only television shows at the time that depicted and celebrated LGBTQ+ figures . Renée makes use of a Black storytelling epistemology in sound, where “Miss Honey” is calling for you and waiting for you to acknowledge her. She also makes reference to feeling, in this case, “Here I am and feeling fierce”. Unlike the melding of the two previous samples, “Miss Honey” stands alone, closing out the song as a final incantation to remember. Although Moi Renée did not belong to a legendary house, she was a dancer from the Alvin Ailey company and staple performer at the club called The Shelter (The Black Gay History Channel 00:44). "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "While sonically “Miss Honey” has been highly regarded by Black LGBTQ+ audiences since its inception, a visual resurgence occurred when The Sybil Bruncheon Show performance was re-uploaded to YouTube in 2007 (The Black Gay History Channel 01:08). That sonic memory being later attached to the released visual performance shows us the ease at which Black LGBTQ+ voices are heard but their visuality is often lost. The fear in depicting Black queerness, transness, and gender non-conforming identities seriously undermines Black cultural memory., This is another reason why Beyoncé’s Renaissance should re-invigorate listeners to archive Blackness for in all its gender, sexually-queer, and trans representations and realities. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Tavia Nyong’o’s book Afrofabulations: The Queer Drama of Black Life contends with the power of the white cinematic gaze, the acknowledgement and critique of Black visuality as a way to destabilize Black temporality. An example comes from Crystal LaBeija’s reading performance in The Queen. Managing to “both to solicit the cinematic gaze and to dispute its power” (15), LaBeija’s reading “...operates as a queer hack of the codes of an anti-black world, and rely for their success on a vernacular awareness of, and confrontation with, the manner in which gender and sexual norms operate to reproduce systems of racial hierarchy.” (17). Nyong’o is keen to analyze the discourse of racialization in LaBeija’s argument. She responds to accusations of “showing her color” with, “I have a right to show my color, darling! I am beautiful and I know I’m beautiful!” (The Queen, 1967). In an effort to see Moi Renée’s performance as an afrofabulation, its resurgence and (re)contribution to Black LGBTQ+ cultural memory and practice speaks volumes. In conclusion, the work of sonic queer afro-modernity– being non-linear as far as its references to the past and projections of the future– is a critical form that allows for works like “PURE/HONEY” to imagine and further intellectualize Black LGBTQ+ futurity."
        }
      ]
    }
  ],
  "citation": "",
  "item_type": "Video",
  "label": "Sample 2: \"Miss Honey\" by Moi Renée",
  "created_at": "2024-10-18T02:02:26.476Z",
  "created_by": "Alyssaf-j",
  "updated_at": "2024-12-02T18:35:17.363Z",
  "updated_by": "Alyssaf-j"
}