{
  "audiovisual_files": {
    "b31a23fb-3258-4906-a6bc-9d36d8d9de0a": {
      "label": "Cunty (Feels Like) by Kevin Aviance",
      "is_offline": false,
      "file_url": "https://www.youtube.com/watch?v=hYTuzFNZftY",
      "duration": 305
    }
  },
  "auto_generate_web_page": true,
  "description": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The legendary Kevin Aviance, born in Richmond Virginia is part of the Legendary House of Aviance, is a DJ, fashion designer and drag queen using he/she pronouns. Aviance’s vocal performance is matched by the cut scenes of her music video for “Cunty (Feels Like)” Wave Mix. The repetition of “cunty” is mixed in with the “cunt” repetition in “Feels Like”, to the point that they are in dialogue with one another and sonically intertwined. Aviance’s descriptions of cuntiness in this case likens itself to flowery eminence. Whether feeling like a daisy, a lily, a rose, or “an orchid!” (performed in exclamation)– the feeling is clear and visible to all. Aviance opens this feeling to all by repeating at the end: “She's cunt, he's cunt, they're cunt, I'm cunt” which makes cuntiness also a unifying essence of self; one that has no gender attachment. Aviance’s physical performance aligns with the “queer eccentric Post-soul” traditions of “gender code switching [and] facial gestures that might threaten a loss of emotional control one minute and then switch to a cool mask the next.” (Royster 28). Sonically, the fact that this song is a mix, brings us back to Weheliye’s argument of sonic afro-modernity. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Chapter three of Phonographies, titled “In the Mix”, Weheliye takes another look at the mixed genre and form of Black intellectual writings and the musical mixes that boast a similar literacy in “the discursive and material arenas of sonic Afro-modernity.” (Weheliye 83). He asserts that the mix “locates temporality and black cultural production primarily at the node of the sonic and modern technologies of sensation/inscription.” (Weheliye 84). Returning to Du Bois’s “Sorrow Songs” in The Souls of Black Folk, Weheliye suggests that Black sounds/mixes “impl[y] that black people have shaped the U.S. economic empire not only through their slave labor, but also, and more significantly, by means of their songs and spirituality. Hence cultural labor is placed above economic labor. The prominent position Du Bois allots to sound inaugurates the use of music as a channel through which to articulate black subjectivity, temporality, spatiality, and culture in the twentieth century.” (Weheliye 86). "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Weheliye argues that the DJ possesses a sonic “double consciousness”, and continues to make a parallel between surrogated performances of Black intellectuality when brought to the cultural product of sound and mix (Weheliye 89). These gestures towards Black sound in particular, the acknowledgement of the inadequacy of words, and the turn to “affect and/or sensation” with the mix all speak to how Black identity, LGBTQ+ identities, are all developed and mixed upon in the realm of sound, music, and a tradition of Black oral intellectuality and criticality. The “Cunty (Feels Like)” Wave Mix contributes Black LGBTQ+ intellectual and cultural canon through the re-rendering or queering of sound. In particular, Aviance moves slowly between the phrases “Feeling cunt, feeling tea”, which gradually gets sped up into the signature mix of “cunt-tea” and the eventual “Cunty” repetition present in “PURE/HONEY”. The ability, through mixing, to innovate on sound and and therefore linguistic boundaries becomes a powerful notion of mixing selfhood and expectation."
        }
      ]
    }
  ],
  "citation": "",
  "item_type": "Video",
  "label": "Sample 1: \"Cunty (Feels Like)\" by Kevin Aviance",
  "created_at": "2024-10-18T02:00:49.188Z",
  "created_by": "Alyssaf-j",
  "updated_at": "2024-12-02T18:34:57.010Z",
  "updated_by": "Alyssaf-j"
}