{
  "audiovisual_files": {
    "43fcdaab-4c6f-448c-8811-642b534fee17": {
      "label": "Feels Like by MikeQ & Kevin JZ Prodigy",
      "is_offline": false,
      "file_url": "https://www.youtube.com/watch?v=DG_2NXSV-Kw",
      "duration": 143
    }
  },
  "auto_generate_web_page": true,
  "item_type": "Audio",
  "label": "Sample 3",
  "description": [
    {
      "text": "“Feels Like” by MikeQ, featuring Kevin JZ Prodigy was released in 2011 on the EP Let it All Out. The intro of an infamous ballroom sound, cymbals echoing bring in Kevin JZ Prodigy’s voice to play with the C major key, 130 BPM and a 3B on the DJ camelot wheel (according to Tunebat.com). Although the song features MikeQ’s DJ signature, “This is a DJ MikeQ production”, it doesn’t get realized on “PURE/HONEY”. The iconic Kevin JZ Prodigy, aka “THE VOICE OF VOGUE” on their Twitter, at this point a staple in the continuity of Renaissance as an MC. Providing a lesson in the art of ballroom through rhythmic commentating, Prodigy hits the beat while creating moments in-between for the performer to reach the final line with a “cunt”, “what”, “uh”, “ah”, “ooh”, or “ow”. As was previously mentioned, the final lines of “Feels Like” are referenced in “PURE/HONEY” , which shows a lineage of concept and sound between the two. The use of onomatopoeic sounds is a critical resource for Prodigy, especially as they perform the sounds and feeling of feline-like cuntiness and femininity. Altogether, the repetition of sounds and play on the beats can be seen as emulating a tradition of scatting, which is an accompaniment to the Black genre of jazz. It would be an interesting conjecture to liken these forms and further uncover their convergences historically.  “what”, “uh”, “ah”, “ooh”, or “ow”. As was previously mentioned, the final lines of “Feels Like” are referenced in “PURE/HONEY”, which shows a lineage of concept and sound between the two. The use of onomatopoeic sounds is a critical resource for Prodigy, especially as they perform the sounds and feeling of feline-like cuntiness and femininity. Altogether, the repetition of sounds and play on the beats can be seen as emulating a tradition of scatting, which is an accompaniment to the Black genre of jazz. It would be an interesting conjecture to liken these forms and further uncover their convergences historically. Although Mike Q and Kevin JZ Prodigy are not regarded as Icons, their work and essential presence in the ballroom scene for more than twenty years makes them iconic. MikeQ from New Jersey and Kevin JZ Prodigy from Philadelphia, they both came up in the scene with their respective houses in the early 2000s, the legendary Houses of Evisu, Valentino, LaBeija and now Ebony for MikeQ and the legendary House of Movado for Prodigy. MikeQ’s interview with Ricky Tucker in And the Category Is... : Inside New York’s Vogue, House, and Ballroom Community gives us intimate insight into MikeQ’s sonic process and inspiration, centering the conversation of the church that is “the holy trinity of the Ballroom floor: DJs, voguers, and MCs.” (Tucker 195).\nThe Black LGBTQ+ experience of being barred from church makes ballroom a chance to “Carv[e] these sacred spaces out on the ball floor [,which] isn’t just an innate instinct; it’s also an answer to a great loss, as many of our Black and brown folks, having been raised in Baptist and Catholic churches, were made unwelcome once ostracized by their families.” (Tucker 191). In loss comes immaculate creation, which thanks to MikeQ (and Prodigy), the “connection between dance spaces/balls and religious experiences fills a loss stemming from missing their spiritual roots, communal spaces where likeness is found and thanks are given.” (Tucker 192). To Tucker’s question, “What about the sound appealed to you, and what tracks drew you in?” MikeQ responds with: \n“I was hearing songs like ‘Din Da Da,’ [by Kevin Aviance] ‘Satisfaction,’ ‘Make These Bitches Gag’ by DJ Vjuan Allure. I didn’t know who Vjuan was at the time, and the track actually said his name in it. I didn’t even know what they were saying; it seemed like some other kind of language to me. I’d never heard a name like that, Vjuan, only to find out how special he’d be to me and the entire community. But there was something about the music and the dancing… I think both of them combined is what really grasped me. Maybe the voguing alone could have gotten me, but in that moment, it was the collaboration of the two, and honestly, I wasn’t into DJing or anything before—Ballroom brought that talent out of me.” (Tucker 197)\n“I was hearing songs like ‘Din Da Da,’ [by Kevin Aviance] ‘Satisfaction,’ ‘Make These Bitches Gag’ by DJ Vjuan Allure. I didn’t know who Vjuan was at the time, and the track actually said his name in it. I didn’t even know what they were saying; it seemed like some other kind of language to me. I’d never heard a name like that, Vjuan, only to find out how special he’d be to me and the entire community. But there was something about the music and the dancing… I think both of them combined is what really grasped me. Maybe the voguing alone could have gotten me, but in that moment, it was the collaboration of the two, and honestly, I wasn’t into DJing or anything before—Ballroom brought that talent out of me.” (Tucker 197)\nInterestingly enough, “Din Da Da” by Kevin Aviance (1997) is a semi-cover of the 1984 hit “Din Daa Daa” (formerly known as “Trommeltanz”) by Berlin singer and drummer George Kranz (Lhooq 2018). The song follows the tradition of ballroom becoming more percussive and connected to certain performances. According to Michelle Lhooq, the 1984 hit “Din Daa Daa” became “a perennial favorite for a ballroom category called ‘Hands’, where dancers sit on a chair and let their fast-flying hands and elbows do the talking.” (Lhooq 2018). The concept of “gagging” is also a part of the Black LGBTQ+ discursive repertoire which MikeQ was exposed to with DJ Vjuan Allure. This “other kind of language”, whether sonic or discursive, speaks to the expansiveness of Black LGBTQ+ epistemologies that move across different units of language and cultural knowledges. \nThe epistemology of Black sound– between gospel from the church, to samples of “hip-hop or R&B, pop, viral videos, TV themes, movie lines” (Tucker 199)– is encapsulated by ballroom and Black LGBTQ+ artists who may not have the chance to enter these spaces physically but can assert their own perspectives and selfhood through mixes. It is through these mixes that artists have been able to intervene, remix and add to the repertoire of Black queer cultural forms and genre. MikeQ references his hometown genre of Jersey club music, “which is just flipping hip-hop songs into these more danceable versions, which is basically what is done in Ballroom.” (Tucker 199). Understanding this lineage of Black LGBTQ+ sound and the position of DJs, MCs and performers all makes sense of what it’s like to contribute to Black culture, history and the future of community identity. Ultimately, this form of what I call soundscaping is a Black LGBTQ+ practice that not only transcends the body’s fixedness and physical estrangement from public place, but makes its way through the bodies of those listening and performing to come to their own realizations and talents. Ballroom becomes a sonic call to move, be in relationship with one another and contribute in the myriad of roles necessary to the fabric of the cultural formation."
    }
  ],
  "created_at": "2024-10-18T06:00:11.281Z",
  "created_by": "Alyssaf-j",
  "updated_at": "2024-10-18T06:00:11.281Z",
  "updated_by": "Alyssaf-j"
}